================================================================================
         PREUVES JALONS C≈íUR DE R√âSEAU - SAE501 (N=4)
         WorldSkills Lyon 2025 - wsl2025.org
================================================================================

JALONS CONCERN√âS (c≈ìur de r√©seau uniquement) :
- Jalon 5  : Plan d'adressage IP + DNS
- Jalon 10 : D√©ploiement VLAN switches
- Jalon 12 : D√©ploiement OSPF/BGP routeurs
- Jalon 13 : HSRP configuration switches
- Jalon 14 : HSRP EDGE routeurs
- Jalon 15 : NAT EDGE WANRTR
- Jalon 16 : Acc√®s DMZ
- Jalon 17 : EDGEX NAT/PAT VPN

NON TRAIT√âS ICI :
- Jalons 1-4 : Gestion projet (PilPro)
- Jalons 7-8 : Simulation EVE-NG (v√©rifi√© directement sur PC)
- Jalons 6,9,11 : ESXi
- Jalons 18-19 : DNS/CA (Cyber)

================================================================================
================================================================================
                         JALON 5 : PLAN D'ADRESSAGE IP + DNS
================================================================================
================================================================================

üìÅ CE QU'IL FAUT RENDRE :
-------------------------
‚ñ° Fichier PLAN-ADRESSAGE-IP.pdf (ou .txt)
‚ñ° Sch√©ma DNS avec les zones et serveurs

üìã CONTENU ATTENDU :
-------------------
1. Tableau des VLANs (10, 20, 30, 99, 100, 200, 300, 666)
2. Adresses IP de tous les √©quipements
3. Plages DHCP
4. Configuration HSRP (VIP, priorit√©s)
5. Sch√©ma DNS (DNSSRV ‚Üí DCWSL ‚Üí HQDCSRV/REMDCSRV)

‚úÖ FICHIER D√âJ√Ä PR√äT : realconf/PLAN-ADRESSAGE-IP.txt

================================================================================
================================================================================
                         JALON 10 : D√âPLOIEMENT VLAN SWITCHES
================================================================================
================================================================================

ORDRE : CORESW1 ‚Üí CORESW2 ‚Üí ACCSW1 ‚Üí ACCSW2

================================================================================
√âTAPE 1 : SE CONNECTER √Ä CORESW1
================================================================================

1. Ouvrir PuTTY/MobaXterm
2. SSH vers 10.4.99.253 (ou console)
3. Login: admin / P@ssw0rd
4. Taper les commandes suivantes (copier-coller) :

show vlan brief
show vtp status
show interfaces trunk
show etherchannel summary
show spanning-tree root
show ip interface brief

5. CAPTURES √Ä FAIRE :
   ‚ñ° J10-CORESW1-vlans.png       ‚Üí show vlan brief
   ‚ñ° J10-CORESW1-vtp.png         ‚Üí show vtp status (VTP Server)
   ‚ñ° J10-CORESW1-trunk.png       ‚Üí show interfaces trunk
   ‚ñ° J10-CORESW1-lacp.png        ‚Üí show etherchannel summary
   ‚ñ° J10-CORESW1-stp.png         ‚Üí show spanning-tree root (Root Bridge)

================================================================================
√âTAPE 2 : SE CONNECTER √Ä CORESW2
================================================================================

1. SSH vers 10.4.99.252
2. Login: admin / P@ssw0rd
3. Taper :

show vlan brief
show vtp status
show interfaces trunk
show etherchannel summary
show spanning-tree root
show ip interface brief

4. CAPTURES √Ä FAIRE :
   ‚ñ° J10-CORESW2-vlans.png       ‚Üí show vlan brief
   ‚ñ° J10-CORESW2-vtp.png         ‚Üí show vtp status (VTP Server backup)
   ‚ñ° J10-CORESW2-lacp.png        ‚Üí show etherchannel summary
   ‚ñ° J10-CORESW2-stp.png         ‚Üí show spanning-tree root (Secondary)

================================================================================
√âTAPE 3 : SE CONNECTER √Ä ACCSW1
================================================================================

1. SSH vers 10.4.99.11
2. Login: admin / P@ssw0rd
3. Taper :

show vlan brief
show vtp status
show interfaces trunk
show port-security
show errdisable recovery
ping 10.4.99.253
ping 10.4.99.252

4. CAPTURES √Ä FAIRE :
   ‚ñ° J10-ACCSW1-vlans.png        ‚Üí show vlan brief
   ‚ñ° J10-ACCSW1-vtp.png          ‚Üí show vtp status (VTP Client)
   ‚ñ° J10-ACCSW1-trunk.png        ‚Üí show interfaces trunk
   ‚ñ° J10-ACCSW1-portsec.png      ‚Üí show port-security
   ‚ñ° J10-ACCSW1-ping.png         ‚Üí ping vers CORESW1 et CORESW2

================================================================================
√âTAPE 4 : SE CONNECTER √Ä ACCSW2
================================================================================

1. SSH vers 10.4.99.12
2. Login: admin / P@ssw0rd
3. Taper :

show vlan brief
show vtp status
show interfaces trunk
show port-security
show errdisable recovery
ping 10.4.99.253
ping 10.4.99.252

4. CAPTURES √Ä FAIRE :
   ‚ñ° J10-ACCSW2-vlans.png        ‚Üí show vlan brief
   ‚ñ° J10-ACCSW2-vtp.png          ‚Üí show vtp status (VTP Client)
   ‚ñ° J10-ACCSW2-trunk.png        ‚Üí show interfaces trunk

================================================================================
√âTAPE 5 : TEST DEPUIS UN PC CLIENT
================================================================================

1. Sur un PC dans VLAN 20 (DHCP ou IP manuelle 10.4.20.x)
2. Ouvrir CMD
3. Taper :

ipconfig
ping 10.4.20.254
ping 10.4.10.254
ping 10.4.99.254

4. CAPTURE √Ä FAIRE :
   ‚ñ° J10-PC-ping-vip.png         ‚Üí Ping vers les VIP HSRP

================================================================================
üìÅ R√âSUM√â JALON 10 - FICHIERS √Ä RENDRE :
================================================================================
‚ñ° J10-CORESW1-vlans.png
‚ñ° J10-CORESW1-vtp.png
‚ñ° J10-CORESW1-trunk.png
‚ñ° J10-CORESW1-lacp.png
‚ñ° J10-CORESW1-stp.png
‚ñ° J10-CORESW2-vlans.png
‚ñ° J10-CORESW2-vtp.png
‚ñ° J10-CORESW2-lacp.png
‚ñ° J10-CORESW2-stp.png
‚ñ° J10-ACCSW1-vlans.png
‚ñ° J10-ACCSW1-vtp.png
‚ñ° J10-ACCSW1-trunk.png
‚ñ° J10-ACCSW1-portsec.png
‚ñ° J10-ACCSW1-ping.png
‚ñ° J10-ACCSW2-vlans.png
‚ñ° J10-ACCSW2-vtp.png
‚ñ° J10-ACCSW2-trunk.png
‚ñ° J10-PC-ping-vip.png

================================================================================
================================================================================
                         JALON 12 : D√âPLOIEMENT OSPF/BGP ROUTEURS
================================================================================
================================================================================

ORDRE : EDGE1 ‚Üí EDGE2 ‚Üí WANRTR

================================================================================
√âTAPE 1 : SE CONNECTER √Ä EDGE1
================================================================================

1. Console ou SSH vers EDGE1
2. Login: admin / P@ssw0rd
3. Taper :

show ip interface brief
show ip ospf neighbor
show ip ospf database
show ip bgp summary
show ip bgp
show ip route
ping 91.4.222.98
ping 10.4.254.14
ping 10.4.254.10

4. CAPTURES √Ä FAIRE :
   ‚ñ° J12-EDGE1-interfaces.png    ‚Üí show ip interface brief
   ‚ñ° J12-EDGE1-ospf.png          ‚Üí show ip ospf neighbor (voisin WANRTR)
   ‚ñ° J12-EDGE1-bgp.png           ‚Üí show ip bgp summary (2 peers)
   ‚ñ° J12-EDGE1-routes.png        ‚Üí show ip route
   ‚ñ° J12-EDGE1-ping.png          ‚Üí Ping WANRTR et EDGE2

================================================================================
√âTAPE 2 : SE CONNECTER √Ä EDGE2
================================================================================

1. Console ou SSH vers EDGE2
2. Login: admin / P@ssw0rd
3. Taper :

show ip interface brief
show ip ospf neighbor
show ip bgp summary
show ip bgp
show ip route
ping 31.4.126.14
ping 10.4.254.17
ping 10.4.254.9

4. CAPTURES √Ä FAIRE :
   ‚ñ° J12-EDGE2-interfaces.png    ‚Üí show ip interface brief
   ‚ñ° J12-EDGE2-ospf.png          ‚Üí show ip ospf neighbor
   ‚ñ° J12-EDGE2-bgp.png           ‚Üí show ip bgp summary
   ‚ñ° J12-EDGE2-routes.png        ‚Üí show ip route
   ‚ñ° J12-EDGE2-ping.png          ‚Üí Ping WANRTR et EDGE1

================================================================================
√âTAPE 3 : SE CONNECTER √Ä WANRTR
================================================================================

1. Console vers WANRTR
2. Login: admin / P@ssw0rd
3. Taper :

show ip interface brief
show vrf
show ip vrf interfaces
show ip ospf vrf MAN neighbor
show bgp vrf INET summary
show bgp vrf INET
ping vrf INET 91.4.222.97
ping vrf INET 31.4.126.13
ping vrf MAN 10.4.254.13
ping vrf MAN 10.4.254.18

4. CAPTURES √Ä FAIRE :
   ‚ñ° J12-WANRTR-vrf.png          ‚Üí show vrf + show ip vrf interfaces
   ‚ñ° J12-WANRTR-ospf.png         ‚Üí show ip ospf vrf MAN neighbor (2 voisins)
   ‚ñ° J12-WANRTR-bgp.png          ‚Üí show bgp vrf INET summary (2 peers)
   ‚ñ° J12-WANRTR-ping.png         ‚Üí Ping vers EDGE1 et EDGE2 (avec vrf)

================================================================================
üìÅ R√âSUM√â JALON 12 - FICHIERS √Ä RENDRE :
================================================================================
‚ñ° J12-EDGE1-interfaces.png
‚ñ° J12-EDGE1-ospf.png
‚ñ° J12-EDGE1-bgp.png
‚ñ° J12-EDGE1-routes.png
‚ñ° J12-EDGE1-ping.png
‚ñ° J12-EDGE2-interfaces.png
‚ñ° J12-EDGE2-ospf.png
‚ñ° J12-EDGE2-bgp.png
‚ñ° J12-EDGE2-routes.png
‚ñ° J12-EDGE2-ping.png
‚ñ° J12-WANRTR-vrf.png
‚ñ° J12-WANRTR-ospf.png
‚ñ° J12-WANRTR-bgp.png
‚ñ° J12-WANRTR-ping.png

================================================================================
================================================================================
                         JALON 13 : HSRP CONFIGURATION SWITCHES
================================================================================
================================================================================

ORDRE : CORESW1 ‚Üí CORESW2 ‚Üí Test failover

================================================================================
√âTAPE 1 : V√âRIFIER HSRP SUR CORESW1 (ACTIVE)
================================================================================

1. SSH vers CORESW1 (10.4.99.253)
2. Taper :

show standby brief
show track 10

3. V√âRIFIER :
   - √âtat "Active" pour les groupes 10, 20, 99
   - Priority = 110
   - Track 10 = UP

4. CAPTURE √Ä FAIRE :
   ‚ñ° J13-CORESW1-hsrp.png        ‚Üí show standby brief (Active)
   ‚ñ° J13-CORESW1-track.png       ‚Üí show track 10 (UP)

================================================================================
√âTAPE 2 : V√âRIFIER HSRP SUR CORESW2 (STANDBY)
================================================================================

1. SSH vers CORESW2 (10.4.99.252)
2. Taper :

show standby brief
show track 20

3. V√âRIFIER :
   - √âtat "Standby" pour les groupes 10, 20, 99
   - Priority = 100

4. CAPTURE √Ä FAIRE :
   ‚ñ° J13-CORESW2-hsrp.png        ‚Üí show standby brief (Standby)
   ‚ñ° J13-CORESW2-track.png       ‚Üí show track 20

================================================================================
√âTAPE 3 : TEST DE FAILOVER (VID√âO RECOMMAND√âE)
================================================================================

1. Sur ACCSW1, lancer un ping continu :
   ping 10.4.99.254 -t    (Windows)
   ou
   ping 10.4.99.254       (5 pings sur switch)

2. Sur CORESW1, couper l'interface Vlan100 :
   conf t
   interface Vlan100
   shutdown
   end

   conf t
   interface Vlan200
   shutdown
   end

3. Observer :
   - Le ping continue apr√®s quelques secondes
   - CORESW2 devient Active

4. V√©rifier sur CORESW2 :
   show standby brief    ‚Üí Maintenant Active

5. R√©activer sur CORESW1 :
   conf t
   interface Vlan100
   no shutdown
   end

   conf t
   interface Vlan200
   no shutdown
   end

6. V√©rifier que CORESW1 redevient Active (preempt)

7. CAPTURES √Ä FAIRE :
   ‚ñ° J13-failover-avant.png      ‚Üí show standby brief avant shutdown
   ‚ñ° J13-failover-apres.png      ‚Üí show standby brief apr√®s shutdown
   ‚ñ° J13-failover-ping.png       ‚Üí Ping continu qui ne s'arr√™te pas

üé¨ VID√âO OPTIONNELLE : J13-VIDEO-HSRP-Failover.mp4

‚ö†Ô∏è  REMISE EN √âTAT APR√àS TEST :
‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ
Sur CORESW1 :
   conf t
   interface Vlan100
   no shutdown
   end
   
V√©rification finale :
   show standby brief
   ‚Üí CORESW1 doit √™tre "Active" sur tous les VLANs (preempt activ√©)
   ‚Üí CORESW2 doit √™tre "Standby"

================================================================================
üìÅ R√âSUM√â JALON 13 - FICHIERS √Ä RENDRE :
================================================================================
‚ñ° J13-CORESW1-hsrp.png
‚ñ° J13-CORESW1-track.png
‚ñ° J13-CORESW2-hsrp.png
‚ñ° J13-CORESW2-track.png
‚ñ° J13-failover-avant.png
‚ñ° J13-failover-apres.png
‚ñ° J13-failover-ping.png
‚ñ° (Optionnel) J13-VIDEO-HSRP-Failover.mp4

================================================================================
================================================================================
                         JALON 14 : HSRP EDGE ROUTEURS
================================================================================
================================================================================

ORDRE : EDGE1 ‚Üí EDGE2

================================================================================
√âTAPE 1 : V√âRIFIER HSRP SUR EDGE1 (ACTIVE)
================================================================================

1. Console vers EDGE1
2. Taper :

show standby brief
show track 10

3. V√âRIFIER :
   - Groupe 30 (VLAN DMZ) = Active
   - Priority = 110
   - VIP = 217.4.160.254

4. CAPTURE √Ä FAIRE :
   ‚ñ° J14-EDGE1-hsrp.png          ‚Üí show standby brief (Active)
   ‚ñ° J14-EDGE1-track.png         ‚Üí show track 10

================================================================================
√âTAPE 2 : V√âRIFIER HSRP SUR EDGE2 (STANDBY)
================================================================================

1. Console vers EDGE2
2. Taper :

show standby brief
show track 20

3. V√âRIFIER :
   - Groupe 30 = Standby
   - Priority = 100

4. CAPTURE √Ä FAIRE :
   ‚ñ° J14-EDGE2-hsrp.png          ‚Üí show standby brief (Standby)
   ‚ñ° J14-EDGE2-track.png         ‚Üí show track 20

================================================================================
üìÅ R√âSUM√â JALON 14 - FICHIERS √Ä RENDRE :
================================================================================
‚ñ° J14-EDGE1-hsrp.png
‚ñ° J14-EDGE1-track.png
‚ñ° J14-EDGE2-hsrp.png
‚ñ° J14-EDGE2-track.png

================================================================================
================================================================================
                         JALON 15 : NAT EDGE WANRTR
================================================================================
================================================================================

ORDRE : EDGE1 ‚Üí EDGE2 ‚Üí Test depuis PC

================================================================================
√âTAPE 1 : V√âRIFIER NAT SUR EDGE1
================================================================================

1. Console vers EDGE1
2. Taper :

show ip nat translations
show ip nat statistics
show access-lists NAT-ACL

3. V√âRIFIER :
   - NAT-ACL autorise 10.4.0.0/16
   - Translations pr√©sentes (si trafic actif)

4. CAPTURE √Ä FAIRE :
   ‚ñ° J15-EDGE1-nat-translations.png ‚Üí show ip nat translations
   ‚ñ° J15-EDGE1-nat-stats.png        ‚Üí show ip nat statistics
   ‚ñ° J15-EDGE1-nat-acl.png          ‚Üí show access-lists NAT-ACL

================================================================================
√âTAPE 2 : V√âRIFIER NAT SUR EDGE2
================================================================================

1. Console vers EDGE2
2. Taper :

show ip nat translations
show ip nat statistics
show access-lists NAT-ACL

3. CAPTURE √Ä FAIRE :
   ‚ñ° J15-EDGE2-nat-translations.png ‚Üí show ip nat translations
   ‚ñ° J15-EDGE2-nat-stats.png        ‚Üí show ip nat statistics

================================================================================
√âTAPE 3 : TEST NAT DEPUIS UN PC INTERNE
================================================================================

1. Sur un PC dans VLAN 10 ou 20
2. Ping vers Internet :
   ping 8.8.4.1

3. Retourner sur EDGE1 :
   show ip nat translations

4. V√âRIFIER que la translation appara√Æt

5. CAPTURE √Ä FAIRE :
   ‚ñ° J15-PC-ping-internet.png       ‚Üí Ping depuis PC vers 8.8.4.1
   ‚ñ° J15-EDGE1-nat-after-ping.png   ‚Üí show ip nat translations avec entr√©e

================================================================================
üìÅ R√âSUM√â JALON 15 - FICHIERS √Ä RENDRE :
================================================================================
‚ñ° J15-EDGE1-nat-translations.png
‚ñ° J15-EDGE1-nat-stats.png
‚ñ° J15-EDGE1-nat-acl.png
‚ñ° J15-EDGE2-nat-translations.png
‚ñ° J15-EDGE2-nat-stats.png
‚ñ° J15-PC-ping-internet.png
‚ñ° J15-EDGE1-nat-after-ping.png

================================================================================
================================================================================
                         JALON 16 : ACC√àS DMZ
================================================================================
================================================================================

ORDRE : EDGE1 ‚Üí EDGE2 ‚Üí Test connectivit√©

================================================================================
√âTAPE 1 : V√âRIFIER INTERFACE DMZ SUR EDGE1
================================================================================

1. Console vers EDGE1
2. Taper :

show ip interface brief | include .30
show ip interface GigabitEthernet0/1.30
show standby brief

3. V√âRIFIER :
   - Interface Gi0/1.30 UP
   - IP = 217.4.160.253/24
   - HSRP VIP = 217.4.160.254

4. CAPTURE √Ä FAIRE :
   ‚ñ° J16-EDGE1-dmz-interface.png    ‚Üí show ip interface brief
   ‚ñ° J16-EDGE1-dmz-hsrp.png         ‚Üí show standby brief

================================================================================
√âTAPE 2 : V√âRIFIER INTERFACE DMZ SUR EDGE2
================================================================================

1. Console vers EDGE2
2. Taper :

show ip interface brief | include .30
show standby brief

3. V√âRIFIER :
   - Interface Gi0/1.30 UP
   - IP = 217.4.160.252/24

4. CAPTURE √Ä FAIRE :
   ‚ñ° J16-EDGE2-dmz-interface.png    ‚Üí show ip interface brief

================================================================================
√âTAPE 3 : TEST PING ENTRE EDGE1 ET EDGE2 VIA DMZ
================================================================================

1. Sur EDGE1 :
   ping 217.4.160.252

2. Sur EDGE2 :
   ping 217.4.160.253

3. CAPTURE √Ä FAIRE :
   ‚ñ° J16-ping-dmz.png               ‚Üí Ping entre EDGE1 et EDGE2

================================================================================
√âTAPE 4 : TEST DEPUIS LE SERVEUR DMZ (SI DISPONIBLE)
================================================================================

1. Sur HQWEBSRV (217.4.160.2) ou HQFW (217.4.160.1)
2. Ping vers la gateway :
   ping 217.4.160.254

3. CAPTURE √Ä FAIRE :
   ‚ñ° J16-dmz-server-ping.png        ‚Üí Ping depuis serveur DMZ

================================================================================
üìÅ R√âSUM√â JALON 16 - FICHIERS √Ä RENDRE :
================================================================================
‚ñ° J16-EDGE1-dmz-interface.png
‚ñ° J16-EDGE1-dmz-hsrp.png
‚ñ° J16-EDGE2-dmz-interface.png
‚ñ° J16-ping-dmz.png
‚ñ° J16-dmz-server-ping.png (si serveur disponible)

================================================================================
================================================================================
                         JALON 17 : EDGEX NAT/PAT VPN
================================================================================
================================================================================

ORDRE : EDGE1 ‚Üí EDGE2 ‚Üí Test depuis Internet

================================================================================
√âTAPE 1 : V√âRIFIER CONFIG NAT STATIQUE SUR EDGE1
================================================================================

1. Console vers EDGE1
2. Taper :

show running-config | include nat
show ip interface Loopback0
show ip route static

3. V√âRIFIER LES R√àGLES NAT STATIQUES :
   - 191.4.157.33:4443 ‚Üí 10.4.10.2:443 (VPN OpenVPN)
   - 191.4.157.33:80   ‚Üí 10.4.10.3:80  (Webmail HTTP)
   - 191.4.157.33:443  ‚Üí 10.4.10.3:443 (Webmail HTTPS)

4. CAPTURE √Ä FAIRE :
   ‚ñ° J17-EDGE1-nat-config.png       ‚Üí show run | include nat
   ‚ñ° J17-EDGE1-loopback.png         ‚Üí show ip interface Loopback0
   ‚ñ° J17-EDGE1-routes-null0.png     ‚Üí show ip route static

================================================================================
√âTAPE 2 : V√âRIFIER CONFIG NAT STATIQUE SUR EDGE2
================================================================================

1. Console vers EDGE2
2. Taper :

show running-config | include nat
show ip interface Loopback0

3. V√âRIFIER LES R√àGLES NAT STATIQUES :
   - 191.4.157.34:4443 ‚Üí 10.4.10.2:443 (VPN OpenVPN backup)
   - 191.4.157.34:80   ‚Üí 10.4.10.3:80  (Webmail HTTP backup)
   - 191.4.157.34:443  ‚Üí 10.4.10.3:443 (Webmail HTTPS backup)

4. CAPTURE √Ä FAIRE :
   ‚ñ° J17-EDGE2-nat-config.png       ‚Üí show run | include nat
   ‚ñ° J17-EDGE2-loopback.png         ‚Üí show ip interface Loopback0

================================================================================
√âTAPE 3 : TEST DEPUIS INTERNET (SI DISPONIBLE)
================================================================================

1. Depuis un PC c√¥t√© Internet (8.8.4.x) ou INETCLT
2. Tester la connectivit√© vers les IPs publiques :
   ping 191.4.157.33
   ping 191.4.157.34

3. Si serveur VPN/Webmail configur√©, tester :
   - Connexion HTTPS vers https://webmail.wsl2025.org
   - Connexion VPN vers vpn.wsl2025.org:4443

4. CAPTURE √Ä FAIRE :
   ‚ñ° J17-internet-ping-loopback.png ‚Üí Ping depuis Internet vers 191.4.157.33

================================================================================
üìÅ R√âSUM√â JALON 17 - FICHIERS √Ä RENDRE :
================================================================================
‚ñ° J17-EDGE1-nat-config.png
‚ñ° J17-EDGE1-loopback.png
‚ñ° J17-EDGE1-routes-null0.png
‚ñ° J17-EDGE2-nat-config.png
‚ñ° J17-EDGE2-loopback.png
‚ñ° J17-internet-ping-loopback.png (si possible)

================================================================================
================================================================================
                         CHECKLIST FINALE
================================================================================
================================================================================

JALON 5 :
‚ñ° PLAN-ADRESSAGE-IP.pdf

JALON 10 (17 captures) :
‚ñ° CORESW1 : vlans, vtp, trunk, lacp, stp
‚ñ° CORESW2 : vlans, vtp, lacp, stp
‚ñ° ACCSW1 : vlans, vtp, trunk, portsec, ping
‚ñ° ACCSW2 : vlans, vtp, trunk
‚ñ° PC : ping VIP

JALON 12 (14 captures) :
‚ñ° EDGE1 : interfaces, ospf, bgp, routes, ping
‚ñ° EDGE2 : interfaces, ospf, bgp, routes, ping
‚ñ° WANRTR : vrf, ospf, bgp, ping

JALON 13 (7 captures + vid√©o optionnelle) :
‚ñ° CORESW1 : hsrp (Active), track
‚ñ° CORESW2 : hsrp (Standby), track
‚ñ° Failover : avant, apr√®s, ping

JALON 14 (4 captures) :
‚ñ° EDGE1 : hsrp, track
‚ñ° EDGE2 : hsrp, track

JALON 15 (7 captures) :
‚ñ° EDGE1 : translations, stats, acl
‚ñ° EDGE2 : translations, stats
‚ñ° PC : ping internet + translations

JALON 16 (5 captures) :
‚ñ° EDGE1 : interface, hsrp
‚ñ° EDGE2 : interface
‚ñ° Ping : entre EDGE + depuis serveur

JALON 17 (5-6 captures) :
‚ñ° EDGE1 : nat config, loopback, routes null0
‚ñ° EDGE2 : nat config, loopback
‚ñ° Internet : ping loopback

================================================================================
                    COMMANDES COPIER-COLLER PAR √âQUIPEMENT
================================================================================

=== CORESW1 (Jalons 10, 13) ===
show vlan brief
show vtp status
show interfaces trunk
show etherchannel summary
show spanning-tree root
show standby brief
show track 10
show ip interface brief

=== CORESW2 (Jalons 10, 13) ===
show vlan brief
show vtp status
show interfaces trunk
show etherchannel summary
show spanning-tree root
show standby brief
show track 20
show ip interface brief

=== ACCSW1 (Jalon 10) ===
show vlan brief
show vtp status
show interfaces trunk
show port-security
show errdisable recovery
ping 10.4.99.253
ping 10.4.99.252

=== ACCSW2 (Jalon 10) ===
show vlan brief
show vtp status
show interfaces trunk
show port-security
show errdisable recovery
ping 10.4.99.253
ping 10.4.99.252

=== EDGE1 (Jalons 12, 14, 15, 16, 17) ===
show ip interface brief
show ip ospf neighbor
show ip ospf database
show ip bgp summary
show ip bgp
show ip route
show standby brief
show track 10
show ip nat translations
show ip nat statistics
show access-lists NAT-ACL
show ip interface Loopback0
show ip route static
show running-config | include nat
ping 91.4.222.98
ping 10.4.254.14
ping 10.4.254.10
ping 217.4.160.252

=== EDGE2 (Jalons 12, 14, 15, 16, 17) ===
show ip interface brief
show ip ospf neighbor
show ip bgp summary
show ip bgp
show ip route
show standby brief
show track 20
show ip nat translations
show ip nat statistics
show access-lists NAT-ACL
show ip interface Loopback0
show ip route static
show running-config | include nat
ping 31.4.126.14
ping 10.4.254.17
ping 10.4.254.9
ping 217.4.160.253

=== WANRTR (Jalon 12) ===
show ip interface brief
show vrf
show ip vrf interfaces
show ip ospf neighbor
show ip bgp summary
show ip bgp
ping 91.4.222.97
ping 31.4.126.13
ping 10.4.254.13
ping 10.4.254.18

================================================================================
